[{"questionPossibilities": ["A. fault tolerance", "B. elasticity", "C. scalability", "D. low latency"], "questionTxt": "You have an on-premises network that contains several servers. You plan to migrate all the servers to Azure. You need to recommend a solution to ensure that some of the servers are available if a single Azure data center goes offline for an extended period. What should you include in the recommendation? ", "answer": " A ", "explanation": "Fault tolerance is the ability of a system to continue to function in the event of a failure of some of its components. In this question, you could have servers that are replicated across datacenters. Availability zones expand the level of control you have to maintain the availability of the applications and data on your VMs. Availability Zones are unique physical locations within an Azure region. Each zone is made up of one or more datacenters equipped with independent power, cooling, and networking. To ensure resiliency, there are a minimum of three separate zones in all enabled regions. The physical separation of Availability Zones within a region protects applications and data from datacenter failures. With Availability Zones, Azure offers industry best 99.99% VM uptime SLA. By architecting your solutions to use replicated VMs in zones, you can protect your applications and data from the loss of a datacenter. If one zone is compromised, then replicated apps and data are instantly available in another zone. ", "questionNumber": 1, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": ["A. dedicated hardware", "B. unsecured connections", "C. limited storage", "D. metered pricing", "E. self-service management"], "questionTxt": "What are two characteristics of the public cloud? Each correct answer presents a complete solution. NOTE: Each correct selection is worth one point. ", "answer": " DE ", "explanation": "With the public cloud, you get pay-as-you-go pricing – you pay only for what you use, no CapEx costs. With the public cloud, you have self-service management.  You are responsible for the deployment and configuration of the cloud resources such as virtual machines or web sites.  The underlying hardware that hosts the cloud resources is managed by the cloud provider. Incorrect Answers: A: You don’t have dedicated hardware.  The underlying hardware is shared so you could have multiple customers using cloud resources hosted on the same physical hardware. B: Connections to the public cloud are secure. C: Storage is not limited.  You can have as much storage as you like. models ", "questionNumber": 2, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your company plans to migrate all its data and resources to Azure. The company’s migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that meets the company migration plan. Solution: You create an Azure App Service and Azure SQL databases. Does this meet the goal? ", "answer": " A ", "explanation": "Azure App Service and Azure SQL databases are examples of Azure PaaS solutions. Therefore, this solution does meet the goal. ", "questionNumber": 3, "section": "Describe Cloud Concepts ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your company plans to migrate all its data and resources to Azure. The company’s migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that meets the company migration plan. Solution: You create an Azure App Service and Azure virtual machines that have Microsoft SQL Server installed. Does this meet the goal? ", "answer": " B ", "explanation": "Azure App Service is a PaaS (Platform as a Service) service.  However, Azure virtual machines are an IaaS (Infrastructure as a Service) service.  Therefore, this solution does not meet the goal. ", "questionNumber": 4, "section": "Describe Cloud Concepts ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your company plans to migrate all its data and resources to Azure. The company’s migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that meets the company migration plan. Solution: You create an Azure App Service and Azure Storage accounts. Does this meet the goal? ", "answer": " B ", "explanation": "Azure App Service is a PaaS (Platform as a Service) service.  However, Azure Storage accounts are an IaaS (Infrastructure as a Service) service.  Therefore, this solution does not meet the goal. ", "questionNumber": 5, "section": "Describe Cloud Concepts ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. high availability", "B. high latency", "C. elasticity", "D. load balancing"], "questionTxt": "Your company hosts an accounting application named App1 that is used by all the customers of the company. App1 has low usage during the first three weeks of each month and very high usage during the last week of each month. Which benefit of Azure Cloud Services supports cost management for this type of usage pattern? ", "answer": " C ", "explanation": "Elasticity in this case is the ability to provide additional compute resource when needed and reduce the compute resource when not needed to reduce costs. Autoscaling is an example of elasticity. Elastic computing is the ability to quickly expand or decrease computer processing, memory and storage resources to meet changing demands without worrying about capacity planning and engineering for peak usage. Typically controlled by system monitoring tools, elastic computing matches the amount of resources allocated to the amount of resources actually needed without disrupting operations. With cloud elasticity, a company avoids paying for unused capacity or idle resources and doesn’t have to worry about investing in the purchase or maintenance of additional resources and equipment. computing/ ", "questionNumber": 6, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": ["A. Software as a Service (SaaS)", "B. Platform as a Service (PaaS)", "C. Infrastructure as a Service (IaaS)", "D. Database as a Service (DaaS)"], "questionTxt": "You plan to migrate a web application to Azure. The web application is accessed by external users. You need to recommend a cloud deployment solution to minimize the amount of administrative effort used to manage the web application. What should you include in the recommendation? ", "answer": " B ", "explanation": "Azure App Service is a platform-as-a-service (PaaS) offering that lets you create web and mobile apps for any platform or device and connect to data anywhere, in the cloud or on-premises. App Service includes the web and mobile capabilities that were previously delivered separately as Azure Websites and Azure Mobile Services. app-services ", "questionNumber": 7, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": ["A. a complete migration to the public cloud", "B. an additional data center", "C. a private cloud", "D. a hybrid cloud"], "questionTxt": "You have an on-premises network that contains 100 servers. You need to recommend a solution that provides additional resources to your users. The solution must minimize capital and operational expenditure costs. What should you include in the recommendation? ", "answer": " D ", "explanation": "A hybrid cloud is a combination of a private cloud and a public cloud. Capital expenditure is the spending of money up-front for infrastructure such as new servers. With a hybrid cloud, you can continue to use the on-premises servers while adding new servers in the public cloud (Azure for example).  Adding new servers in Azure minimizes the capital expenditure costs as you are not paying for new servers as you would if you deployed new server on-premises. Incorrect Answers: A: A complete migration of 100 servers to the public cloud would involve a lot of operational expenditure (the cost of migrating all the servers). B: An additional data center would involve a lot of capital expenditure (the cost of the new infrastructure). C: A private cloud is hosted on on-premises servers to this would involve a lot of capital expenditure (the cost of the new infrastructure to host the private cloud). models ", "questionNumber": 8, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": ["A. The public cloud is owned by the public, NOT a private corporation", "B. The public cloud is a crowd-sourcing solution that provides corporations with the ability to enhance the cloud", "C. All public cloud resources can be freely accessed by every member of the public", "D. The public cloud is a shared entity whereby multiple corporations each use a portion of the resources in the cloud"], "questionTxt": "You plan to migrate several servers from an on-premises network to Azure. What is an advantage of using a public cloud service for the servers over an on-premises network? ", "answer": " D ", "explanation": "The public cloud is a shared entity whereby multiple corporations each use a portion of the resources in the cloud.  The hardware resources (servers, infrastructure etc.) are managed by the cloud provider. Multiple companies create resources such as virtual machines and virtual networks on the hardware resources. Incorrect Answers: A: The public cloud is not owned by the public.  In the case of Microsoft Azure, the cloud is owned by Microsoft. B: The public cloud is a not crowd-sourcing solution. In the case of Microsoft Azure, the cloud is owned by Microsoft. C: It is not true that public cloud resources can be freely accessed by every member of the public.  You pay for a cloud subscription and create accounts for your users to access your cloud resources.  No one can access your cloud resources until you create user accounts and provide the appropriate access permissions. ", "questionNumber": 9, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": ["A. private", "B. hybrid", "C. public"], "questionTxt": "In which type of cloud model are all the hardware resources owned by a third-party and shared between multiple tenants? ", "answer": " C ", "explanation": "Microsoft Azure, Amazon Web Services and Google Cloud are three examples of public cloud services. Microsoft, Amazon and Google own the hardware.  The tenants are the customers who use the public cloud services. ", "questionNumber": 10, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": ["A. operational", "B. elastic", "C. capital", "D. scalable"], "questionTxt": "You have 1,000 virtual machines hosted on the Hyper-V hosts in a data center. You plan to migrate all the virtual machines to an Azure pay-as-you-go subscription. You need to identify which expenditure model to use for the planned Azure solution. Which expenditure model should you identify? ", "answer": " A ", "explanation": "One of the major changes that you will face when you move from on-premises cloud to the public cloud is the switch from capital expenditure (buying hardware) to operating expenditure (paying for service as you use it). This switch also requires more careful management of your costs. The benefit of the cloud is that you can fundamentally and positively affect the cost of a service you use by merely shutting down or resizing it when it's not needed. ", "questionNumber": 11, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": [], "questionTxt": "DRAG DROP Match the Azure Cloud Services benefit to the correct description. Instructions: To answer, drag the appropriate benefit from the column on the left to its description on the right. Each benefit may be used once, more than once, or not at all. NOTE: Each correct match is worth one point. Select and Place: ", "answer": "  ", "explanation": "Box 1: Fault tolerance is the ability of a service to remain available after a failure of one of the components of the service.  For example, a service running on multiple servers can withstand the failure of one of the servers. Box 2: Disaster recovery is the recovery of a service after a failure. For example, restoring a virtual machine from backup after a virtual machine failure. Box 3: Dynamic scalability is the ability for compute resources to be added to a service when the service is under heavy load.  For example, in a virtual machine scale set, additional instances of the virtual machine are added when the existing virtual machines are under heavy load. Box 4: Latency is the time a service to respond to requests.  For example, the time it takes for a web page to be returned from a web server.  Low latency means low response time which means a quicker response. DR ", "questionNumber": 12, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": ["A. Replacing failed server hardware", "B. Backing up application data", "C. Managing physical server security", "D. Updating server operating systems", "E. Managing permissions to shared documents"], "questionTxt": "Your company has an on-premises network that contains multiple servers. The company plans to reduce the following administrative responsibilities of network administrators: Backing up application data Replacing failed server hardware Managing physical server security Updating server operating systems Managing permissions to shared documents The company plans to migrate several servers to Azure virtual machines. You need to identify which administrative responsibilities will be eliminated after the planned migration. Which two responsibilities should you identify? Each correct answer presents a complete solution. NOTE: Each correct selection is worth one point. ", "answer": " AC ", "explanation": "Azure virtual machines run on Hyper-V physical servers.  The physical servers are owned and managed by Microsoft.  As an Azure customer, you have no access to the physical servers.  Microsoft manage the replacement of failed server hardware and the security of the physical servers so you don’t need to. Incorrect Answers: B: Microsoft have no control over the applications you run on the virtual machines.  Therefore, it is your responsibility to ensure that application data is backed up. D: Microsoft do not manage the operating systems you run on the virtual machines.  Therefore, it is your responsibility to ensure that the operating systems are updated. E: Microsoft have no control over the shared folders you host on the virtual machines.  Therefore, it is your responsibility to ensure that folder permissions are configured appropriately. ", "questionNumber": 13, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": ["A. an Azure web app", "B. an Azure virtual machine", "C. an Azure logic app", "D. an Azure SQL database"], "questionTxt": "You plan to provision Infrastructure as a Service (IaaS) resources in Azure. Which resource is an example of IaaS? ", "answer": " B ", "explanation": "An Azure virtual machine is an example of Infrastructure as a Service (IaaS). Azure web app, Azure logic app and Azure SQL database are all examples of Platform as a Service (Paas). iaas/ ", "questionNumber": 14, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": ["A. private cloud and hybrid cloud only", "B. private cloud only", "C. private cloud, hybrid cloud and public cloud", "D. hybrid cloud only"], "questionTxt": "To which cloud models can you deploy physical servers? ", "answer": " A ", "explanation": "A private cloud is on-premises so you can deploy physical servers. A hybrid cloud is a mix of on-premise and public cloud resources. You can deploy physical servers on-premises. ", "questionNumber": 15, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": [], "questionTxt": "DRAG DROP Match the cloud model to the correct advantage. Instructions: To answer, drag the appropriate cloud model from the column on the left to its advantage on the right. Each cloud model may be used once, more than once, or not at all. NOTE: Each correct match is worth one point Select and Place: ", "answer": "  ", "explanation": "Box 1: Public Cloud With a public cloud, there is no capital expenditure on server hardware etc.  You only pay for cloud resources that you use as you use them. Box 2: Private Cloud A private cloud exists on premises, so you have complete control over security. Box 3: Hybrid Cloud A hybrid cloud is a mix of public cloud resources and on-premises resources.  Therefore, you have a choice to use either. ", "questionNumber": 16, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": ["A. hybrid", "B. private", "C. public"], "questionTxt": "You have 50 virtual machines hosted on-premises and 50 virtual machines hosted in Azure. The on-premises virtual machines and the Azure virtual machines connect to each other. Which type of cloud model is this? ", "answer": " A ", "explanation": "computing/ ", "questionNumber": 17, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your company plans to migrate all its data and resources to Azure. The company’s migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that meets the company migration plan. Solution: You create Azure virtual machines, Azure SQL databases, and Azure Storage accounts. Does this meet the goal? ", "answer": " B ", "explanation": "Platform as a service (PaaS) is a complete development and deployment environment in the cloud. PaaS includes infrastructure — servers, storage, and networking — but also middleware, development tools, business intelligence (BI) services, database management systems, and more. PaaS is designed to support the complete web application lifecycle: building, testing, deploying, managing, and updating. However, virtual machines are examples of Infrastructure as a service (IaaS). IaaS is an instant computing infrastructure, provisioned and managed over the internet. us/overview/what-is-iaas/ ", "questionNumber": 18, "section": "Describe Cloud Concepts ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Software as a Service (SaaS)", "B. Platform as a Service (PaaS)", "C. Infrastructure as a Service (laaS)"], "questionTxt": "Your company plans to deploy several custom applications to Azure. The applications will provide invoicing services to the customers of the company. Each application will have several prerequisite applications and services installed. You need to recommend a cloud deployment solution for all the applications. What should you recommend? ", "answer": " C ", "explanation": "Infrastructure as a service (IaaS) is an instant computing infrastructure, provisioned and managed over the internet. The IaaS service provider manages the infrastructure, while you purchase, install, configure, and manage your own software Incorrect Answers: A: Software as a service (SaaS) allows users to connect to and use cloud-based apps over the Internet. Common examples are email, calendaring, and office tools. In this scenario, you need to run your own apps, and therefore require an infrastructure. B: Platform as a service (PaaS) is a complete development and deployment environment in the cloud. PaaS includes infrastructure—servers, storage, and networking —but also middleware, development tools, business intelligence (BI) services, database management systems, and more. PaaS is designed to support the complete web application lifecycle: building, testing, deploying, managing, and updating. iaas/ ", "questionNumber": 19, "section": "Describe Cloud Concepts ", "questionNote": ""}, {"questionPossibilities": ["A. No change is needed", "B. Is found in each country where Microsoft has a subsidiary office", "C. Can be found in every country in Europe and the Americas only", "D. Contains one or more data centers that are connected by using a high-latency network"], "questionTxt": "This question requires that you evaluate the underlined text to determine if it is correct. An Azure region contains one or more data centers that are connected by using a low-latency network. Instructions: Review the underlined text. If it makes the statement correct, select “No change is needed”. If the statement is incorrect, select the answer choice that makes the statement correct. ", "answer": " A ", "explanation": "A region is a set of data centres deployed within a latency-defined perimeter and connected through a dedicated regional low-latency network. Microsoft Azure currently has 55 regions worldwide. Regions are divided into Availability Zones. Availability Zones are physically separate locations within an Azure region. Each Availability Zone is made up of one or more datacenters equipped with independent power, cooling, and networking. ", "questionNumber": 20, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to two or more availability zones. Does this meet the goal? ", "answer": " A ", "explanation": "Availability zones expand the level of control you have to maintain the availability of the applications and data on your VMs. An Availability Zone is a physically separate zone, within an Azure region. There are three Availability Zones per supported Azure region. Each Availability Zone has a distinct power source, network, and cooling. By architecting your solutions to use replicated VMs in zones, you can protect your apps and data from the loss of a datacenter. If one zone is compromised, then replicated apps and data are instantly available in another zone. ", "questionNumber": 21, "section": "Describe Core Azure Services ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. No change is needed", "B. automatic scaling", "C. data compression", "D. versioning"], "questionTxt": "This question requires that you evaluate the underlined text to determine if it is correct. One of the benefits of Azure SQL Data Warehouse is that high availability is built into the platform. Instructions: Review the underlined text. If it makes the statement correct, select “No change is needed”. If the statement is incorrect, select the answer choice that makes the statement correct. ", "answer": " A ", "explanation": "Azure Data Warehouse (now known as Azure Synapse Analytics) is a PaaS offering from Microsoft.  As with all PaaS services from Microsoft, SQL Data Warehouse offers an availability SLA of 99.9%.  Microsoft can offer 99.9% availability because it has high availability features built into the platform. overview-faq ", "questionNumber": 22, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to two or more regions. Does this meet the goal? ", "answer": " A ", "explanation": "By deploying the virtual machines to two or more regions, you are deploying the virtual machines to multiple datacenters.  This will ensure that the services running on the virtual machines are available if a single data center fails. Azure operates in multiple datacenters around the world. These datacenters are grouped in to geographic regions, giving you flexibility in choosing where to build your applications. You create Azure resources in defined geographic regions like 'West US', 'North Europe', or 'Southeast Asia'. You can review the list of regions and their locations. Within each region, multiple datacenters exist to provide for redundancy and availability. ", "questionNumber": 23, "section": "Describe Core Azure Services ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Azure Data Lake", "B. Azure Cosmos DB", "C. Azure SQL Data Warehouse", "D. Azure SQL Database", "E. Azure Database for PostgreSQL"], "questionTxt": "You plan to store 20 TB of data in Azure. The data will be accessed infrequently and visualized by using Microsoft Power BI. You need to recommend a storage solution for the data. Which two solutions should you recommend? Each correct answer presents a complete solution. NOTE: Each correct selection is worth one point. ", "answer": " AC ", "explanation": "You can use Power BI to analyze and visualize data stored in Azure Data Lake and Azure SQL Data Warehouse. Azure Data Lake includes all of the capabilities required to make it easy for developers, data scientists and analysts to store data of any size and shape and at any speed, and do all types of processing and analytics across platforms and languages. It removes the complexities of ingesting and storing all your data while making it faster to get up and running with batch, streaming and interactive analytics. It also integrates seamlessly with operational stores and data warehouses so that you can extend current data applications. lake-store/data-lake-store-power-bi ", "questionNumber": 24, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": ["A. a physical server failure", "B. an Azure region failure", "C. a storage failure", "D. an Azure data center failure"], "questionTxt": "You need to identify the type of failure for which an Azure Availability Zone can be used to protect access to Azure services. What should you identify? ", "answer": " D ", "explanation": "Availability zones expand the level of control you have to maintain the availability of the applications and data on your VMs. An Availability Zone is a physically separate zone, within an Azure region. There are three Availability Zones per supported Azure region. Each Availability Zone has a distinct power source, network, and cooling. By architecting your solutions to use replicated VMs in zones, you can protect your apps and data from the loss of a datacenter. If one zone is compromised, then replicated apps and data are instantly available in another zone. ", "questionNumber": 25, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to two or more resource groups. Does this meet the goal? ", "answer": " B ", "explanation": "A resource group is a logical container for Azure resources.  When you create a resource group, you specify which location to create the resource group in. However, when you create a virtual machine and place it in the resource group, the virtual machine can still be in a different location (different datacenter). Therefore, creating multiple resource groups, even if they are in separate datacenters does not ensure that the services running on the virtual machines are available if a single data center fails. groups ", "questionNumber": 26, "section": "Describe Core Azure Services ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to a scale set. Does this meet the goal? ", "answer": " B ", "explanation": "This answer does not specify that the scale set will be configured across multiple data centers so this solution does not meet the goal. Azure virtual machine scale sets let you create and manage a group of load balanced VMs. The number of VM instances can automatically increase or decrease in response to demand or a defined schedule. Scale sets provide high availability to your applications, and allow you to centrally manage, configure, and update many VMs. Virtual machines in a scale set can be deployed across multiple update domains and fault domains to maximize availability and resilience to outages due to data center outages, and planned or unplanned maintenance events. ", "questionNumber": 27, "section": "Describe Core Azure Services ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. No change is needed", "B. Management groups", "C. Azure policies", "D. Azure App Service plans"], "questionTxt": "This question requires that you evaluate the underlined text to determine if it is correct. Resource groups provide organizations with the ability to manage the compliance of Azure resources across multiple subscriptions. Instructions: Review the underlined text. If it makes the statement correct, select “No change is needed”. If the statement is incorrect, select the answer choice that makes the statement correct. ", "answer": " C ", "explanation": "Azure policies can be used to define requirements for resource properties during deployment and for already existing resources. Azure Policy controls properties such as the types or locations of resources. Azure Policy is a service in Azure that you use to create, assign, and manage policies. These policies enforce different rules and effects over your resources, so those resources stay compliant with your corporate standards and service level agreements. Azure Policy meets this need by evaluating your resources for noncompliance with assigned policies. All data stored by Azure Policy is encrypted at rest. For example, you can have a policy to allow only a certain SKU size of virtual machines in your environment. Once this policy is implemented, new and existing resources are evaluated for compliance. With the right type of policy, existing resources can be brought into compliance. us/azure/governance/policy/overview ", "questionNumber": 28, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": ["A. multiple subscriptions", "B. multiple Azure Active Directory (Azure AD) directories", "C. multiple regions", "D. multiple resource groups"], "questionTxt": "Your company plans to migrate to Azure. The company has several departments. All the Azure resources used by each department will be managed by a department administrator. What are two possible techniques to segment Azure for the departments? Each correct answer presents a complete solution. NOTE: Each correct selection is worth one point. ", "answer": " AD ", "explanation": "An Azure subscription is a container for Azure resources.  It is also a boundary for permissions to resources and for billing.  You are charged monthly for all resources in a subscription.  A single Azure tenant (Azure Active Directory) can contain multiple Azure subscriptions. A resource group is a container that holds related resources for an Azure solution. The resource group can include all the resources for the solution, or only those resources that you want to manage as a group. To enable each department administrator to manage the Azure resources used by that department, you will need to create a separate subscription per department. You can then assign each department administrator as an administrator for the subscription to enable them to manage all resources in that subscription. administrator ", "questionNumber": 29, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": ["A. a virtual network gateway", "B. a load balancer", "C. an application gateway", "D. a virtual network", "E. a gateway subnet"], "questionTxt": "You have an Azure environment that contains multiple Azure virtual machines. You plan to implement a solution that enables the client computers on your on-premises network to communicate to the Azure virtual machines. You need to recommend which Azure resources must be created for the planned solution. Which two Azure resources should you include in the recommendation? Each correct answer presents part of the solution. NOTE: Each correct selection is worth one point. ", "answer": " AE ", "explanation": "To implement a solution that enables the client computers on your on-premises network to communicate to the Azure virtual machines, you need to configure a VPN (Virtual Private Network) to connect the on-premises network to the Azure virtual network. The Azure VPN device is known as a Virtual Network Gateway.  The virtual network gateway needs to be located in a dedicated subnet in the Azure virtual network.  This dedicated subnet is known as a gateway subnet and must be named ‘GatewaySubnet’. Note: a virtual network (answer D) is also required.  However, as we already have virtual machines deployed in a Azure, we can assume that the virtual network is already in place. ", "questionNumber": 30, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": ["A. Create a service health alert", "B. Upgrade your support plan", "C. Modify an Azure policy", "D. Create a new support request"], "questionTxt": "You attempt to create several managed Microsoft SQL Server instances in an Azure environment and receive a message that you must increase your Azure subscription limits. What should you do to increase the limits? ", "answer": " D ", "explanation": "Many Azure resource have quote limits.  The purpose of the quota limits is to help you control your Azure costs.  However, it is common to require an increase to the default quota. You can request a quota limit increase by opening a support request.  In the support request, select ‘Service and subscription limits (quotas)’ for the Issue type, select your subscription and the service you want to increase the quota for.  For this question, you would select ‘SQL Database Managed Instance’ as the quote type. ", "questionNumber": 31, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": ["A. a resource group for FinServer and another resource group for all the other servers", "B. a virtual network for FinServer and another virtual network for all the other servers", "C. a VPN for FinServer and a virtual network gateway for each other server", "D. one resource group for all the servers and a resource lock for FinServer"], "questionTxt": "Your company plans to move several servers to Azure. The company’s compliance policy states that a server named FinServer must be on a separate network segment. You are evaluating which Azure services can be used to meet the compliance policy requirements. Which Azure solution should you recommend? ", "answer": " B ", "explanation": "Networks in Azure are known as virtual networks.  A virtual network can have multiple IP address spaces and multiple subnets.  Azure automatically routes traffic between different subnets within a virtual network. The question states that FinServer must be on a separate network segment.  The only way to separate FinServer from the other servers in networking terms is to place the server in a different virtual network to the other servers. design-arm ", "questionNumber": 32, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": ["A. an Azure SQL database", "B. a virtual machine data disk", "C. a Files service in a storage account", "D. a Blobs service in a storage account"], "questionTxt": "You plan to map a network drive from several computers that run Windows 10 to Azure Storage. You need to create a storage solution in Azure for the planned mapped drive. What should you create? ", "answer": " C ", "explanation": "Azure Files is Microsoft's easy-to-use cloud file system. Azure file shares can be seamlessly used in Windows and Windows Server. To use an Azure file share with Windows, you must either mount it, which means assigning it a drive letter or mount point path, or access it via its UNC path. Unlike other SMB shares you may have interacted with, such as those hosted on a Windows Server, Linux Samba server, or NAS device, Azure file shares do not currently support Kerberos authentication with your Active Directory (AD) or Azure Active Directory (AAD) identity, although this is a feature we are working on. Instead, you must access your Azure file share with the storage account key for the storage account containing your Azure file share. A storage account key is an administrator key for a storage account, including administrator permissions to all files and folders within the file share you're accessing, and for all file shares and other storage resources (blobs, queues, tables, etc) contained within your storage account. windows ", "questionNumber": 33, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": ["A. a subscription", "B. a resource group", "C. a virtual network", "D. a management group"], "questionTxt": "Your company plans to migrate all its network resources to Azure. You need to start the planning process by exploring Azure. What should you create first? ", "answer": " A ", "explanation": "The first thing you create in Azure is a subscription.  You can think of an Azure subscription as an ‘Azure account’.  You get billed per subscription. A subscription is an agreement with Microsoft to use one or more Microsoft cloud platforms or services, for which charges accrue based on either a per-user license fee or on cloud-based resource consumption. Microsoft's Software as a Service (SaaS)-based cloud offerings (Office 365, Intune/EMS, and Dynamics 365) charge per-user license fees. Microsoft's Platform as a Service (PaaS) and Infrastructure as a Service (IaaS) cloud offerings (Azure) charge based on cloud resource consumption. You can also use a trial subscription, but the subscription expires after a specific amount of time or consumption charges. You can convert a trial subscription to a paid subscription. Organizations can have multiple subscriptions for Microsoft's cloud offerings. offerings ", "questionNumber": 34, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Event Hubs", "B. Azure Analysis Services", "C. Azure Monitor", "D. Azure Stream Analytics"], "questionTxt": "Which Azure service should you use to collect events from multiple resources into a centralized repository? ", "answer": " A ", "explanation": "Azure Event Hubs is a big data streaming platform and event ingestion service. It can receive and process millions of events per second. Data sent to an event hub can be transformed and stored by using any real-time analytics provider or batching/storage adapters. Azure Event Hubs can be used to ingest, buffer, store, and process your stream in real time to get actionable insights. Event Hubs uses a partitioned consumer model, enabling multiple applications to process the stream concurrently and letting you control the speed of processing. Azure Event Hubs can be used to capture your data in near-real time in an Azure Blob storage or Azure Data Lake Storage for long-term retention or micro-batch processing. ", "questionNumber": 35, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to two or more scale sets. Does this meet the goal? ", "answer": " B ", "explanation": "This answer does not specify that the scale set will be configured across multiple data centers so this solution does not meet the goal. Azure virtual machine scale sets let you create and manage a group of load balanced VMs. The number of VM instances can automatically increase or decrease in response to demand or a defined schedule. Scale sets provide high availability to your applications, and allow you to centrally manage, configure, and update many VMs. Virtual machines in a scale set can be deployed across multiple update domains and fault domains to maximize availability and resilience to outages due to data center outages, and planned or unplanned maintenance events. ", "questionNumber": 36, "section": "Describe Core Azure Services ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Azure Monitor", "B. Azure Service Health", "C. Azure Advisor", "D. Microsoft Trust Center"], "questionTxt": "You need to be notified when Microsoft plans to perform maintenance that can affect the resources deployed to an Azure subscription. What should you use? ", "answer": " B ", "explanation": "Azure Service Health provides a personalized view of the health of the Azure services and regions you're using. This is the best place to look for service impacting communications about outages, planned maintenance activities, and other health advisories because the authenticated Service Health experience knows which services and resources you currently use. ", "questionNumber": 37, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": [], "questionTxt": "DRAG DROP Match the Azure Services service to the correct description. Instructions: To answer, drag the appropriate service from the column on the left to its description on the right. Each service may be used once, more than once, or not at all. NOTE: Each correct selection is worth one point. Select and Place: ", "answer": "  ", "explanation": "", "questionNumber": 38, "section": "Describe Core Azure Services ", "questionNote": ""}, {"questionPossibilities": [], "questionTxt": "DRAG DROP Match the Azure service to the correct description. Instructions: To answer, drag the appropriate Azure service from the column on the left to its description on the right. Each service may be used once, more than once, or not at all. NOTE: Each correct selection is worth one point. Select and Place: ", "answer": "  ", "explanation": "Box 1: Azure Bot Services provides a digital online assistant that provides speech support. Bots provide an experience that feels less like using a computer and more like dealing with a person - or at least an intelligent robot. They can be used to shift simple, repetitive tasks, such as taking a dinner reservation or gathering profile information, on to automated systems that may no longer require direct human intervention. Users converse with a bot using text, interactive cards, and speech. A bot interaction can be a quick question and answer, or it can be a sophisticated conversation that intelligently provides access to services. Box 2: Azure Machine Learning uses past trainings to provide predictions that have high probability. Machine learning is a data science technique that allows computers to use existing data to forecast future behaviors, outcomes, and trends. By using machine learning, computers learn without being explicitly programmed. Forecasts or predictions from machine learning can make apps and devices smarter. For example, when you shop online, machine learning helps recommend other products you might want based on what you've bought. Box 3: Azure Functions provides serverless computing functionalities. Azure Functions is a serverless compute service that lets you run event-triggered code without having to explicitly provision or manage infrastructure. Box 4: IoT Hub (Internet of things Hub) provides data from millions of sensors. IoT Hub is a managed service, hosted in the cloud, that acts as a central message hub for bi-directional communication between your IoT application and the devices it manages. You can use Azure IoT Hub to build IoT solutions with reliable and secure communications between millions of IoT devices and a cloud-hosted solution backend. You can connect virtually any device to IoT Hub. us/azure/azure-functions/ ", "questionNumber": 39, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "An Azure administrator plans to run a PowerShell script that creates Azure resources. You need to recommend which computer configuration to use to run the script. Solution: Run the script from a computer that runs Windows 10 and has the Azure PowerShell module installed. Does this meet the goal? ", "answer": " A ", "explanation": "A PowerShell script is a file that contains PowerShell cmdlets and code. A PowerShell script needs to be run in PowerShell. In this question, the computer has the Azure PowerShell module installed. Therefore, this solution does meet the goal. 6 ", "questionNumber": 40, "section": "Describe core solutions and management tools on Azure ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": [], "questionTxt": "DRAG DROP Match the Azure services to the correct description. Instructions: To answer, drag the appropriate Azure service from the column on the left to its description on the right. Each service may be used once, more than once, or not at all. NOTE: Each correct selection is worth one point. Select and Place: ", "answer": "  ", "explanation": "Box 1: Azure virtual machines provide operation system virtualization. Azure Virtual Machines (VM) is one of several types of on-demand, scalable computing resources that Azure offers. Typically, you choose a VM when you need more control over the computing environment than the other choices offer. Box 2: Azure Container Instances provide portable environments for virtualized applications. Containers are becoming the preferred way to package, deploy, and manage cloud applications. Azure Container Instances offers the fastest and simplest way to run a container in Azure, without having to manage any virtual machines and without having to adopt a higher-level service. Containers offer significant startup benefits over virtual machines (VMs). Azure Container Instances can start containers in Azure in seconds, without the need to provision and manage VMs. Box 3: Azure App Service is used to build, deploy and scale web apps. Azure App Service is a platform-as-a-service (PaaS) offering that lets you create web and mobile apps for any platform or device and connect to data anywhere, in the cloud or on-premises. App Service includes the web and mobile capabilities that were previously delivered separately as Azure Websites and Azure Mobile Services. Box 4: Azure Functions provide a platform for serverless code. Azure Functions is a serverless compute service that lets you run event-triggered code without having to explicitly provision or manage infrastructure. services us/azure/container-instances/container-instances-overview ", "questionNumber": 41, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Virtual Machines", "B. Azure Functions", "C. Azure storage account", "D. Azure dedicated hosts"], "questionTxt": "Which service provides serverless computing in Azure? ", "answer": " B ", "explanation": "Azure Functions provide a platform for serverless code. Azure Functions is a serverless compute service that lets you run event-triggered code without having to explicitly provision or manage infrastructure. ", "questionNumber": 42, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "You have an Azure subscription named Subscription1. You sign in to the Azure portal and create a resource group named RG1. From Azure documentation, you have the following command that creates a virtual machine named VM1. az vm create --resource-group RG1 --name VM1 --image UbuntuLTS --generate-ssh-keys You need to create VM1 in Subscription1 by using the command. Solution: From the Azure portal, launch Azure Cloud Shell and select Bash. Run the command in Cloud Shell. Does this meet the goal? ", "answer": " A ", "explanation": "The command can be run in the Azure Cloud Shell. The Azure Cloud Shell is a free interactive shell. It has common Azure tools preinstalled and configured to use with your account. To open the Cloud Shell, just select Try it from the upper right corner of a code block. You can also launch Cloud Shell in a separate browser tab by going to cli ", "questionNumber": 43, "section": "Describe core solutions and management tools on Azure ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Azure Resource Manager templates", "B. virtual machine scale sets", "C. the Azure API Management service", "D. management groups"], "questionTxt": "Your company has several business units. Each business unit requires 20 different Azure resources for daily operation. All the business units require the same type of Azure resources. You need to recommend a solution to automate the creation of the Azure resources. What should you include in the recommendations? ", "answer": " A ", "explanation": "You can use Azure Resource Manager templates to automate the creation of the Azure resources.  Deploying resource through templates is known as ‘Infrastructure as code’. To implement infrastructure as code for your Azure solutions, use Azure Resource Manager templates. The template is a JavaScript Object Notation (JSON) file that defines the infrastructure and configuration for your project. The template uses declarative syntax, which lets you state what you intend to deploy without having to write the sequence of programming commands to create it. In the template, you specify the resources to deploy and the properties for those resources. manager/templates/overview ", "questionNumber": 44, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": [], "questionTxt": "DRAG DROP Match the Azure service to the correct definition. Instructions: To answer, drag the appropriate Azure service from the column on the left to its description on the right. Each service may be used once, more than once, or not at all. NOTE: Each correct selection is worth one point. Select and Place: ", "answer": "  ", "explanation": "Box 1: Azure Functions provides the platform for serverless code. Azure Functions is a serverless compute service that lets you run event-triggered code without having to explicitly provision or manage infrastructure. Box 2: Azure Databricks is a big analysis service for machine learning. Azure Databricks is an Apache Spark-based analytics platform.  The platform consists of several components including ‘MLib’.  Mlib is a Machine Learning library consisting of common learning algorithms and utilities, including classification, regression, clustering, collaborative filtering, dimensionality reduction, as well as underlying optimization primitives. Box 3: Azure Application Insights detects and diagnoses anomalies in web apps. Application Insights, a feature of Azure Monitor, is an extensible Application Performance Management (APM) service for developers and DevOps professionals. Use it to monitor your live applications. It will automatically detect performance anomalies, and includes powerful analytics tools to help you diagnose issues and to understand what users actually do with your app. Box 4: Azure App Service hosts web apps. Azure App Service is an HTTP-based service for hosting web applications, REST APIs, and mobile back ends. You can develop in your favorite language, be it .NET, .NET Core, Java, Ruby, Node.js, PHP, or Python. Applications run and scale with ease on both Windows and Linux-based environments. databricks/what-is-azure-databricks#apache-spark-based-analytics-platform us/azure/azure-monitor/app/app-insights-overview ", "questionNumber": 45, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Reserved Virtual Machines (VM) Instances", "B. Azure virtual machine scale sets", "C. Azure DevTest Labs", "D. Microsoft Managed Desktop"], "questionTxt": "A team of developers at your company plans to deploy, and then remove, 50 customized virtual machines each week. Thirty of the virtual machines run Windows You need to recommend which Azure service will minimize the administrative effort required to deploy and remove the virtual machines. What should you recommend? ", "answer": " C ", "explanation": "DevTest Labs creates labs consisting of pre-configured bases or Azure Resource Manager templates. By using DevTest Labs, you can test the latest versions of your applications by doing the following tasks: Quickly provision Windows and Linux environments by using reusable templates and artifacts. Easily integrate your deployment pipeline with DevTest Labs to provision on-demand environments. Scale up your load testing by provisioning multiple test agents and create pre-provisioned environments for training and demos. ", "questionNumber": 2016, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Command Prompt", "B. Azure Resource Explorer", "C. Windows PowerShell", "D. Windows Defender Firewall", "E. Network and Sharing Center"], "questionTxt": "A support engineer plans to perform several Azure management tasks by using the Azure CLI. You install the CLI on a computer. You need to tell the support engineer which tools to use to run the CLI. Which two tools should you instruct the support engineer to use? Each correct answer presents a complete solution. NOTE: Each correct selection is worth one point. ", "answer": " AC ", "explanation": "For Windows the Azure CLI is installed via an MSI, which gives you access to the CLI through the Windows Command Prompt (CMD) or PowerShell. ", "questionNumber": 47, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "You have an Azure environment. You need to create a new Azure virtual machine from a tablet that runs the Android operating system. Solution: You use PowerShell in Azure Cloud Shell. Does this meet the goal? ", "answer": " A ", "explanation": "Azure Cloud Shell is a browser-based shell experience to manage and develop Azure resources. Cloud Shell offers a browser-accessible, pre-configured shell experience for managing Azure resources without the overhead of installing, versioning, and maintaining a machine yourself. Being browser-based, Azure Cloud Shell can be run on a browser from a tablet that runs the Android operating system. shell/features ", "questionNumber": 48, "section": "Describe core solutions and management tools on Azure ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "You have an Azure environment. You need to create a new Azure virtual machine from a tablet that runs the Android operating system. Solution: You use the PowerApps portal. Does this meet the goal? ", "answer": " B ", "explanation": "PowerApps lets you quickly build business applications with little or no code.  It is not used to create Azure virtual machines. Therefore, this solution does not meet the goal. PowerApps Portals allow organizations to create websites which can be shared with users external to their organization either anonymously or through the login provider of their choice like LinkedIn, Microsoft Account, other commercial login providers. users/ ", "questionNumber": 49, "section": "Describe core solutions and management tools on Azure ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "You have an Azure environment. You need to create a new Azure virtual machine from a tablet that runs the Android operating system. Solution: You use the Azure portal. Does this meet the goal? ", "answer": " A ", "explanation": "The Azure portal is a web-based, unified console that provides an alternative to command-line tools. With the Azure portal, you can manage your Azure subscription using a graphical user interface. You can build, manage, and monitor everything from simple web apps to complex cloud deployments. Create custom dashboards for an organized view of resources. Configure accessibility options for an optimal experience. Being web-based, the Azure portal can be run on a browser from a tablet that runs the Android operating system. overview ", "questionNumber": 50, "section": "Describe core solutions and management tools on Azure ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. No change is needed.", "B. Azure Data Factory", "C. Azure DevOps", "D. Azure HDInsight"], "questionTxt": "This question requires that you evaluate the underlined text to determine if it is correct. Azure Databricks is an Apache Spark-based analytics service. Instructions: Review the underlined text. If it makes the statement correct, select “No change is needed.” If the statement is incorrect, select the answer choice that makes the statement correct. ", "answer": " A ", "explanation": "Azure Databricks is an Apache Spark-based analytics platform.  The platform consists of several components including ‘MLib’.  Mlib is a Machine Learning library consisting of common learning algorithms and utilities, including classification, regression, clustering, collaborative filtering, dimensionality reduction, as well as underlying optimization primitives. platform ", "questionNumber": 51, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Repos", "B. Azure DevTest Labs", "C. Azure Storage", "D. Azure Cosmos DB"], "questionTxt": "Which Azure service provides a set of version control tools to manage code? ", "answer": " A ", "explanation": "Azure Repos is a set of version control tools that you can use to manage your code. Incorrect Answers: B: Azure DevTest Labs creates labs consisting of pre-configured bases or Azure Resource Manager templates. These have all the necessary tools and software that you can use to create environments. D: Azure Cosmos DB is Microsoft's globally distributed, multi-model database service. repos?view=azure-devops ", "questionNumber": 52, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Service Fabric", "B. Azure Monitor", "C. Azure virtual machines", "D. Azure Advisor"], "questionTxt": "You have a virtual machine named VM1 that runs Windows Server 2016. VM1 is in the East US Azure region. Which Azure service should you use from the Azure portal to view service failure notifications that can affect the availability of VM1? ", "answer": " C ", "explanation": "In the Azure virtual machines page in the Azure portal, there is a named Maintenance Status.  This column will display service issues that could affect your virtual machine.  A service failure is rare but host server maintenance that could affect your virtual machines is more common. Azure periodically updates its platform to improve the reliability, performance, and security of the host infrastructure for virtual machines. The purpose of these updates ranges from patching software components in the hosting environment to upgrading networking components or decommissioning hardware. updates ", "questionNumber": 53, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "An Azure administrator plans to run a PowerShell script that creates Azure resources. You need to recommend which computer configuration to use to run the script. Solution: Run the script from a computer that runs Linux and has the Azure CLI tools installed. Does this meet the goal? ", "answer": " B ", "explanation": "A PowerShell script is a file that contains PowerShell cmdlets and code. A PowerShell script needs to be run in PowerShell. PowerShell can now be installed on Linux. However, the question states that the computer has Azure CLI tools, not PowerShell installed.  Therefore, this solution does not meet the goal. 6 ", "questionNumber": 54, "section": "Describe core solutions and management tools on Azure ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "An Azure administrator plans to run a PowerShell script that creates Azure resources. You need to recommend which computer configuration to use to run the script. Solution: Run the script from a computer that runs Chrome OS and uses Azure Cloud Shell. Does this meet the goal? ", "answer": " A ", "explanation": "A PowerShell script is a file that contains PowerShell cmdlets and code. A PowerShell script needs to be run in PowerShell. With the Azure Cloud Shell, you can run PowerShell cmdlets and scripts in a Web browser. You log in to the Azure Portal and select the Azure Cloud Shell option. This will open a PowerShell session in the Web browser.  The Azure Cloud Shell has the necessary Azure PowerShell module installed. Note: to run a PowerShell script in the Azure Cloud Shell, you need to change to the directory where the PowerShell script is stored. powershell ", "questionNumber": 55, "section": "Describe core solutions and management tools on Azure ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "An Azure administrator plans to run a PowerShell script that creates Azure resources. You need to recommend which computer configuration to use to run the script. Solution: Run the script from a computer that runs macOS and has PowerShell Core 6.0 installed. Does this meet the goal? ", "answer": " A ", "explanation": "A PowerShell script is a file that contains PowerShell cmdlets and code. A PowerShell script needs to be run in PowerShell. In this question, the computer has PowerShell Core 6.0 installed. Therefore, this solution does meet the goal. Note: To create Azure resources using PowerShell, you would need to import the Azure PowerShell module which includes the PowerShell cmdlets required to create the resources. 6 ", "questionNumber": 56, "section": "Describe core solutions and management tools on Azure ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": [], "questionTxt": "DRAG DROP Match the Azure service to the correct definition. Instructions: To answer, drag the appropriate Azure service from the column on the left to its description on the right. Each service may be used once, more than once, or not at all. NOTE: Each correct match is worth one point. Select and Place: ", "answer": "  ", "explanation": "Box 1: Azure DevOps. Azure DevOps is Microsoft’s primary software development and deployment platform. DevOps influences the application lifecycle throughout its plan, develop, deliver and operate phases. Box 2: Azure Advisor. Advisor is a personalized cloud consultant that helps you follow best practices to optimize your Azure deployments. It analyzes your resource configuration and usage telemetry and then recommends solutions that can help you improve the cost effectiveness, performance, high availability, and security of your Azure resources. Box 3: Azure Cognitive Services. Azure Cognitive Services are APIs, SDKs, and services available to help developers build intelligent applications without having direct AI or data science skills or knowledge. Azure Cognitive Services enable developers to easily add cognitive features into their applications. The goal of Azure Cognitive Services is to help developers create applications that can see, hear, speak, understand, and even begin to reason. The catalog of services within Azure Cognitive Services can be categorized into five main pillars - Vision, Speech, Language, Web Search, and Decision. Box 4. Azure Application Insights. Azure Application Insights detects and diagnoses anomalies in web apps. Application Insights, a feature of Azure Monitor, is an extensible Application Performance Management (APM) service for developers and DevOps professionals. Use it to monitor your live applications. It will automatically detect performance anomalies, and includes powerful analytics tools to help you diagnose issues and to understand what users actually do with your app. us/azure/advisor/advisor-overview services/welcome ", "questionNumber": 57, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": [], "questionTxt": "DRAG DROP Match the Azure service to the correct description. Instructions: To answer, drag the appropriate Azure service from the column on the left to its description on the right. Each service may be used once, more than once, or not at all. NOTE: Each correct match is worth one point. Select and Place: ", "answer": "  ", "explanation": "Box 1: Azure SQL Database SQL Server is a relational database service.  Azure SQL Database is a managed SQL Server Database in Azure.  The SQL Server is managed by Microsoft; you just have access to the database. Box 2: Azure SQL Synapse Analytics Azure SQL Synapse Analytics (previously called Data Warehouse) is a cloud-based Platform-as-a-Service (PaaS) offering from Microsoft. It is a large-scale, distributed, MPP (massively parallel processing) relational database technology in the same class of competitors as Amazon Redshift or Snowflake. Azure SQL Synapse Analytics is an important component of the Modern Data Warehouse multi-platform architecture. Because Azure SQL Synapse Analytics is an MPP system with a shared-nothing architecture across distributions, it is meant for large-scale analytical workloads which can take advantage of parallelism. Box 3: Azure Data Lake Analytics You can process big data jobs in seconds with Azure Data Lake Analytics. You can process petabytes of data for diverse workload categories such as querying, ETL, analytics, machine learning, machine translation, image processing and sentiment analysis by leveraging existing libraries written in .NET languages, R or Python. Box 4: Azure HDInsight. Apache Hadoop was the original open-source framework for distributed processing and analysis of big data sets on clusters. The Hadoop ecosystem includes related software and utilities, including Apache Hive, Apache HBase, Spark, Kafka, and many others. Azure HDInsight is a fully managed, full-spectrum, open-source analytics service in the cloud for enterprises. The Apache Hadoop cluster type in Azure HDInsight allows you to use HDFS, YARN resource management, and a simple MapReduce programming model to process and analyze batch data in parallel. ", "questionNumber": 58, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "You have an Azure environment. You need to create a new Azure virtual machine from a tablet that runs the Android operating system. Solution: You use Bash in Azure Cloud Shell. Does this meet the goal? ", "answer": " A ", "explanation": "With Azure Cloud Shell, you can create virtual machines using Bash or PowerShell. Azure Cloud Shell is an interactive, authenticated, browser-accessible shell for managing Azure resources. It provides the flexibility of choosing the shell experience that best suits the way you work, either Bash or PowerShell. us/azure/cloud-shell/overview ", "questionNumber": 59, "section": "Describe core solutions and management tools on Azure ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. a web app", "B. a server image in Azure Marketplace", "C. a logic app", "D. an API app"], "questionTxt": "You have an on-premises application that sends email notifications automatically based on a rule. You plan to migrate the application to Azure. You need to recommend a serverless computing solution for the application. What should you include in the recommendation? ", "answer": " C ", "explanation": "Azure Logic Apps is a cloud service that helps you schedule, automate, and orchestrate tasks, business processes, and workflows when you need to integrate apps, data, systems, and services across enterprises or organizations. Logic Apps simplifies how you design and build scalable solutions for app integration, data integration, system integration, enterprise application integration (EAI), and business-to-business (B2B) communication, whether in the cloud, on premises, or both. For example, here are just a few workloads you can automate with logic apps: Process and route orders across on-premises systems and cloud services. Send email notifications with Office 365 when events happen in various systems, apps, and services. Move uploaded files from an SFTP or FTP server to Azure Storage. Monitor tweets for a specific subject, analyze the sentiment, and create alerts or tasks for items that need review. overview ", "questionNumber": 60, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. an application gateway", "B. an Azure ExpressRoute circuit", "C. a content delivery network (CDN)", "D. an Azure Traffic Manager profile"], "questionTxt": "You plan to deploy a website to Azure. The website will be accessed by users worldwide and will host large video files. You need to recommend which Azure feature must be used to provide the best video playback experience. What should you recommend? ", "answer": " C ", "explanation": "The question states that users are located worldwide and will be downloading large video files.  The video playback experience would be improved if they can download the video from servers in the same region as the users.  We can achieve this by using a content deliver network. A content delivery network (CDN) is a distributed network of servers that can efficiently deliver web content to users. CDNs store cached content on edge servers in point-of-presence (POP) locations that are close to end users, to minimize latency. Azure Content Delivery Network (CDN) offers developers a global solution for rapidly delivering high-bandwidth content to users by caching their content at strategically placed physical nodes across the world. Azure CDN can also accelerate dynamic content, which cannot be cached, by leveraging various network optimizations using CDN POPs. For example, route optimization to bypass Border Gateway Protocol (BGP). The benefits of using Azure CDN to deliver web site assets include: Better performance and improved user experience for end users, especially when using applications in which multiple round-trips are required to load content. Large scaling to better handle instantaneous high loads, such as the start of a product launch event. Distribution of user requests and serving of content directly from edge servers so that less traffic is sent to the origin server. overview ", "questionNumber": 61, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Data Lake", "B. Azure Queue storage", "C. Azure File Storage", "D. Azure IoT Hub", "E. Azure Notification Hubs"], "questionTxt": "Your company plans to deploy several million sensors that will upload data to Azure. You need to identify which Azure resources must be created to support the planned solution. Which two Azure resources should you identify? Each correct answer presents part of the solution. NOTE: Each correct selection is worth one point. ", "answer": " AD ", "explanation": "IoT Hub (Internet of things Hub) provides data from millions of sensors. IoT Hub is a managed service, hosted in the cloud, that acts as a central message hub for bi-directional communication between your IoT application and the devices it manages. You can use Azure IoT Hub to build IoT solutions with reliable and secure communications between millions of IoT devices and a cloud-hosted solution backend. You can connect virtually any device to IoT Hub. There are two storage services IoT Hub can route messages to -- Azure Blob Storage and Azure Data Lake Storage Gen2 (ADLS Gen2) accounts. Azure Data Lake Storage accounts are hierarchical namespace-enabled storage accounts built on top of blob storage. Both of these use blobs for their storage. d2c ", "questionNumber": 62, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Azure CLI", "B. the Azure portal", "C. Azure Cloud Shell", "D. Windows PowerShell", "E. Azure Storage Explorer"], "questionTxt": "You have an Azure web app. You need to manage the settings of the web app from an iPhone. What are two Azure management tools that you can use? Each correct answer presents a complete solution. NOTE: Each correct selection is worth one point. ", "answer": " BC ", "explanation": "The Azure portal is the web-based portal for managing Azure.  Being web-based, you can use the Azure portal on an iPhone. Azure Cloud Shell is a web-based command line for managing Azure. You access the Azure Cloud Shell from the Azure portal. Being web-based, you can use the Azure Cloud Shell on an iPhone. Incorrect Answers: A: Azure CLI can be installed on MacOS but it cannot be installed on an iPhone. D: Windows PowerShell can be installed on MacOS but it cannot be installed on an iPhone. E: Azure Storage Explorer is not used to manage Azure web apps. ipad/ ", "questionNumber": 63, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Logic Apps", "B. Azure Machine Learning Designer", "C. Azure Batch", "D. Azure Cosmos DB"], "questionTxt": "Your company plans to deploy an Artificial Intelligence (AI) solution in Azure. What should the company use to build, test, and deploy predictive analytics solutions? ", "answer": " B ", "explanation": "Azure Machine Learning designer lets you visually connect datasets and modules on an interactive canvas to create machine learning models. ", "questionNumber": 64, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Advisor", "B. Azure Service Health", "C. Azure Monitor", "D. Azure Network Watcher"], "questionTxt": "What can you use to automatically send an alert if an administrator stops an Azure virtual machine? ", "answer": " C ", "explanation": "", "questionNumber": 65, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Use Bash in Azure Cloud Shell.", "B. Use PowerShell in Azure Cloud Shell.", "C. Use the PowerApps portal.", "D. Use the Security & Compliance admin center.", "E. Use the Azure portal."], "questionTxt": "You have an Azure environment. You need to create a new Azure virtual machine from a tablet that runs the Android operating system. What are three possible solutions? Each correct answer presents a complete solution. NOTE: Each correct selection is worth one point. ", "answer": " ABE ", "explanation": "The Android tablet device will have a web browser (Chrome).  That’s enough to connect to the Azure portal. The Azure portal offers three ways to create a VM: Using the graphical portal. Using the Azure Cloud Shell using Bash. Using the Azure Cloud Shell using PowerShell. ", "questionNumber": 66, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Reserved Virtual Machine (VM) Instances", "B. Azure DevTest Labs", "C. Azure virtual machine scale sets", "D. Microsoft Managed Desktop"], "questionTxt": "A team of developers at your company plans to deploy, and then remove, 50 virtual machines each week. All the virtual machines are configured by using Azure Resource Manager templates. You need to recommend which Azure service will minimize the administrative effort required to deploy and remove the virtual machines. What should you recommend? ", "answer": " B ", "explanation": "DevTest Labs creates labs consisting of pre-configured bases or Azure Resource Manager templates. By using DevTest Labs, you can test the latest versions of your applications by doing the following tasks: Quickly provision Windows and Linux environments by using reusable templates and artifacts. Easily integrate your deployment pipeline with DevTest Labs to provision on-demand environments. Scale up your load testing by provisioning multiple test agents and create pre-provisioned environments for training and demos. ", "questionNumber": 67, "section": "Describe core solutions and management tools on Azure ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "You have an Azure subscription named Subscription1. You sign in to the Azure portal and create a resource group named RG1. From Azure documentation, you have the following command that creates a virtual machine named VM1. az vm create --resource-group RG1 --name VM1 --image UbuntuLTS --generate-ssh-keys You need to create VM1 in Subscription1 by using the command. Solution: From the Azure portal, launch Azure Cloud Shell and select PowerShell. Run the command in Cloud Shell. Does this meet the goal? ", "answer": " A ", "explanation": "The command can be run in the Azure Cloud Shell. Although this question says you select PowerShell rather than Bash, the Az commands will work in PowerShell. The Azure Cloud Shell is a free interactive shell. It has common Azure tools preinstalled and configured to use with your account. To open the Cloud Shell, just select Try it from the upper right corner of a code block. You can also launch Cloud Shell in a separate browser tab by going to ", "questionNumber": 68, "section": "Describe core solutions and management tools on Azure ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "You have an Azure subscription named Subscription1. You sign in to the Azure portal and create a resource group named RG1. From Azure documentation, you have the following command that creates a virtual machine named VM1. az vm create --resource-group RG1 --name VM1 --image UbuntuLTS --generate-ssh-keys You need to create VM1 in Subscription1 by using the command. Solution: From a computer that runs Windows 10, install Azure CLI. From PowerShell, sign in to Azure and then run the command. Does this meet the goal? ", "answer": " B ", "explanation": "The command can be run from PowerShell or the command prompt if you have the Azure CLI installed. However, it must be run on the Windows 10 computer, not in Azure. ", "questionNumber": 69, "section": "Describe core solutions and management tools on Azure ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "You have an Azure subscription named Subscription1. You sign in to the Azure portal and create a resource group named RG1. From Azure documentation, you have the following command that creates a virtual machine named VM1. az vm create --resource-group RG1 --name VM1 --image UbuntuLTS --generate-ssh-keys You need to create VM1 in Subscription1 by using the command. Solution: From a computer that runs Windows 10, install Azure CLI. From a command prompt, sign in to Azure and then run the command. Does this meet the goal? ", "answer": " B ", "explanation": "The command can be run from PowerShell or the command prompt if you have the Azure CLI installed. However, it must be run on the Windows 10 computer, not in Azure. ", "questionNumber": 70, "section": "Describe core solutions and management tools on Azure ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your Azure environment contains multiple Azure virtual machines. You need to ensure that a virtual machine named VM1 is accessible from the Internet over HTTP. Solution: You modify an Azure firewall. Does this meet the goal? ", "answer": " A ", "explanation": "Azure Firewall is a managed, cloud-based network security service that protects your Azure Virtual Network resources. It's a fully stateful firewall as a service with built-in high availability and unrestricted cloud scalability. In this question, we need to add a rule to Azure Firewall to allow the connection to the virtual machine on port 80 (HTTP). us/azure/firewall/overview ", "questionNumber": 71, "section": "Describe general security and network security features ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your Azure environment contains multiple Azure virtual machines. You need to ensure that a virtual machine named VM1 is accessible from the Internet over HTTP. Solution: You modify an Azure Traffic Manager profile. Does this meet the goal? ", "answer": " B ", "explanation": "Azure Traffic Manager is a DNS-based load balancing solution.  It is not used to ensure that a virtual machine named VM1 is accessible from the Internet over HTTP. To ensure that a virtual machine named VM1 is accessible from the Internet over HTTP, you need to modify a network security group or Azure Firewall. In this question, we need to add a rule to a network security group or Azure Firewall to allow the connection to the virtual machine on port 80 (HTTP). overview ", "questionNumber": 72, "section": "Describe general security and network security features ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. network security groups (NSGs)", "B. Azure Service Bus", "C. a local network gateway", "D. a route filter"], "questionTxt": "Your company plans to deploy several web servers and several database servers to Azure. You need to recommend an Azure solution to limit the types of connections from the web servers to the database servers. What should you include in the recommendation? ", "answer": " A ", "explanation": "A network security group works like a firewall.  You can attach a network security group to a virtual network and/or individual subnets within the virtual network. You can also attach a network security group to a network interface assigned to a virtual machine.  You can use multiple network security groups within a virtual network to restrict traffic between resources such as virtual machines and subnets. You can filter network traffic to and from Azure resources in an Azure virtual network with a network security group. A network security group contains security rules that allow or deny inbound network traffic to, or outbound network traffic from, several types of Azure resources. overview ", "questionNumber": 73, "section": "Describe general security and network security features ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Firewall", "B. an application security group", "C. Azure DDoS protection", "D. a network security group (NSG)"], "questionTxt": "Which service provides network traffic filtering across multiple Azure subscriptions and virtual networks? ", "answer": " A ", "explanation": "You can restrict traffic to multiple virtual networks in multiple subscriptions with a single Azure firewall. Azure Firewall is a managed, cloud-based network security service that protects your Azure Virtual Network resources. It's a fully stateful firewall as a service with built-in high availability and unrestricted cloud scalability. You can centrally create, enforce, and log application and network connectivity policies across subscriptions and virtual networks. Azure Firewall uses a static public IP address for your virtual network resources allowing outside firewalls to identify traffic originating from your virtual network. us/azure/firewall/overview ", "questionNumber": 74, "section": "Describe general security and network security features ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Security Center", "B. an Azure Storage account", "C. Azure Key Vault", "D. Azure Information Protection"], "questionTxt": "Which Azure service should you use to store certificates? ", "answer": " C ", "explanation": "Azure Key Vault is a secure store for storage various types of sensitive information including passwords and certificates. Azure Key Vault can be used to Securely store and tightly control access to tokens, passwords, certificates, API keys, and other secrets. Secrets and keys are safeguarded by Azure, using industry-standard algorithms, key lengths, and hardware security modules (HSMs). The HSMs used are Federal Information Processing Standards (FIPS) 140-2 Level 2 validated. Access to a key vault requires proper authentication and authorization before a caller (user or application) can get access. Authentication establishes the identity of the caller, while authorization determines the operations that they are allowed to perform. overview ", "questionNumber": 75, "section": "Describe general security and network security features ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Firewall", "B. a network security group (NSG)", "C. Azure Information Protection", "D. DDoS protection"], "questionTxt": "You need to configure an Azure solution that meets the following requirements: Secures websites from attacks Generates reports that contain details of attempted attacks What should you include in the solution? ", "answer": " D ", "explanation": "DDoS is a type of attack that tries to exhaust application resources. The goal is to affect the application’s availability and its ability to handle legitimate requests. DDoS attacks can be targeted at any endpoint that is publicly reachable through the internet. Azure has two DDoS service offerings that provide protection from network attacks: DDoS Protection Basic and DDoS Protection Standard. DDoS Basic protection is integrated into the Azure platform by default and at no extra cost. You have the option of paying for DDoS Standard. It has several advantages over the basic service, including logging, alerting, and telemetry.  DDoS Standard can generate reports that contain details of attempted attacks as required in this question. practices ", "questionNumber": 76, "section": "Describe general security and network security features ", "questionNote": ""}, {"questionPossibilities": ["A. Modify an Azure Traffic Manager profile", "B. Modify a network security group (NSG)", "C. Modify a DDoS protection plan", "D. Modify an Azure firewall"], "questionTxt": "Your Azure environment contains multiple Azure virtual machines. You need to ensure that a virtual machine named VM1 is accessible from the Internet over HTTP. What are two possible solutions? Each correct answer presents a complete solution. NOTE: Each correct selection is worth one point. ", "answer": " B ", "explanation": "A network security group works like a firewall.  You can attach a network security group to a virtual network and/or individual subnets within the virtual network. You can also attach a network security group to a network interface assigned to a virtual machine.  You can use multiple network security groups within a virtual network to restrict traffic between resources such as virtual machines and subnets. You can filter network traffic to and from Azure resources in an Azure virtual network with a network security group. A network security group contains security rules that allow or deny inbound network traffic to, or outbound network traffic from, several types of Azure resources. In this question, we need to add a rule to the network security group to allow the connection to the virtual machine on port 80 (HTTP). ", "questionNumber": 77, "section": "Describe general security and network security features ", "questionNote": ""}, {"questionPossibilities": ["A. one application security group (ASG)", "B. 10 virtual network gateways", "C. 10 Azure ExpressRoute circuits", "D. one Azure firewall"], "questionTxt": "You have an Azure environment that contains 10 virtual networks and 100 virtual machines. You need to limit the amount of inbound traffic to all the Azure virtual networks. What should you create? ", "answer": " D ", "explanation": "You can restrict traffic to multiple virtual networks with a single Azure firewall. Azure Firewall is a managed, cloud-based network security service that protects your Azure Virtual Network resources. It's a fully stateful firewall as a service with built-in high availability and unrestricted cloud scalability. You can centrally create, enforce, and log application and network connectivity policies across subscriptions and virtual networks. Azure Firewall uses a static public IP address for your virtual network resources allowing outside firewalls to identify traffic originating from your virtual network. us/azure/firewall/overview ", "questionNumber": 78, "section": "Describe general security and network security features ", "questionNote": ""}, {"questionPossibilities": ["A. No change is needed", "B. Azure Active Directory (Azure AD) administrative accounts", "C. Personally Identifiable Information (PII)", "D. server applications"], "questionTxt": "This question requires that you evaluate the underlined text to determine if it is correct. Azure Key Vault is used to store secrets for Azure Active Directory (Azure AD) user accounts. Instructions: Review the underlined text. If it makes the statement correct, select “No change is needed”. If the statement is incorrect, select the answer choice that makes the statement correct. ", "answer": " D ", "explanation": "Centralizing storage of application secrets in Azure Key Vault allows you to control their distribution. Key Vault greatly reduces the chances that secrets may be accidentally leaked. When using Key Vault, application developers no longer need to store security information in their application. Not having to store security information in applications eliminates the need to make this information part of the code. For example, an application may need to connect to a database. Instead of storing the connection string in the app's code, you can store it securely in Key Vault. vault/ ", "questionNumber": 79, "section": "Describe general security and network security features ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Key Vault", "B. Azure Information Protection", "C. Azure Security Center", "D. Azure Multi-Factor Authentication (MFA)"], "questionTxt": "Your company plans to automate the deployment of servers to Azure. Your manager is concerned that you may expose administrative credentials during the deployment. You need to recommend an Azure solution that encrypts the administrative credentials during the deployment. What should you include in the recommendation? ", "answer": " A ", "explanation": "Azure Key Vault is a secure store for storage various types of sensitive information. In this question, we would store the administrative credentials in the Key Vault. With this solution, there is no need to store the administrative credentials as plain text in the deployment scripts. All information stored in the Key Vault is encrypted. Azure Key Vault can be used to Securely store and tightly control access to tokens, passwords, certificates, API keys, and other secrets. Secrets and keys are safeguarded by Azure, using industry-standard algorithms, key lengths, and hardware security modules (HSMs). The HSMs used are Federal Information Processing Standards (FIPS) 140-2 Level 2 validated. Access to a key vault requires proper authentication and authorization before a caller (user or application) can get access. Authentication establishes the identity of the caller, while authorization determines the operations that they are allowed to perform. overview ", "questionNumber": 80, "section": "Describe general security and network security features ", "questionNote": ""}, {"questionPossibilities": ["A. a network security group (NSG)", "B. an Azure Active Directory (Azure AD) role", "C. an Azure Active Directory group", "D. an Azure key vault"], "questionTxt": "You plan to deploy several Azure virtual machines. You need to control the ports that devices on the Internet can use to access the virtual machines. What should you use? ", "answer": " A ", "explanation": "A network security group works like a firewall.  You can attach a network security group to a virtual network and/or individual subnets within the virtual network. You can also attach a network security group to a network interface assigned to a virtual machine.  You can use multiple network security groups within a virtual network to restrict traffic between resources such as virtual machines and subnets. You can filter network traffic to and from Azure resources in an Azure virtual network with a network security group. A network security group contains security rules that allow or deny inbound network traffic to, or outbound network traffic from, several types of Azure resources. overview ", "questionNumber": 81, "section": "Describe general security and network security features ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your Azure environment contains multiple Azure virtual machines. You need to ensure that a virtual machine named VM1 is accessible from the Internet over HTTP. Solution: You modify a network security group (NSG). Does this meet the goal? ", "answer": " A ", "explanation": "A network security group works like a firewall.  You can attach a network security group to a virtual network and/or individual subnets within the virtual network. You can also attach a network security group to a network interface assigned to a virtual machine.  You can use multiple network security groups within a virtual network to restrict traffic between resources such as virtual machines and subnets. You can filter network traffic to and from Azure resources in an Azure virtual network with a network security group. A network security group contains security rules that allow or deny inbound network traffic to, or outbound network traffic from, several types of Azure resources. In this question, we need to add a rule to the network security group to allow the connection to the virtual machine on port 80 (HTTP). overview ", "questionNumber": 82, "section": "Describe general security and network security features ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your Azure environment contains multiple Azure virtual machines. You need to ensure that a virtual machine named VM1 is accessible from the Internet over HTTP. Solution: You modify a DDoS protection plan. Does this meet the goal? ", "answer": " B ", "explanation": "DDoS is a form of attack on a network resource.  A DDoS protection plan is used to protect against DDoS attacks; it does not provide connectivity to a virtual machine. To ensure that a virtual machine named VM1 is accessible from the Internet over HTTP, you need to modify a network security group or Azure Firewall. overview ", "questionNumber": 83, "section": "Describe general security and network security features ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Azure Sentinel", "B. Azure Synapse Analytics", "C. Azure AD Connect", "D. Azure Key Vault"], "questionTxt": "You need to collect and automatically analyze security events from Azure Active Directory (Azure AD). What should you use? ", "answer": " A ", "explanation": "", "questionNumber": 84, "section": "Describe general security and network security features ", "questionNote": ""}, {"questionPossibilities": ["A. Azure AD Connect Health", "B. Azure AD Privileged Identity Management", "C. Azure Advanced Threat Protection (ATP)", "D. Azure AD Identity Protection"], "questionTxt": "You need to ensure that when Azure Active Directory (Azure AD) users connect to Azure AD from the Internet by using an anonymous IP address, the users are prompted automatically to change their password. Which Azure service should you use? ", "answer": " D ", "explanation": "Azure AD Identity Protection includes two risk policies: sign-in risk policy and user risk policy. A sign-in risk represents the probability that a given authentication request isn’t authorized by the identity owner. There are several types of risk detection.  One of them is Anonymous IP Address. This risk detection type indicates sign-ins from an anonymous IP address (for example, Tor browser or anonymous VPN). These IP addresses are typically used by actors who want to hide their login telemetry (IP address, location, device, etc.) for potentially malicious intent. You can configure the sign-in risk policy to require that users change their password. policy risks ", "questionNumber": 85, "section": "Describe identity, governance, privacy, and compliance features ", "questionNote": ""}, {"questionPossibilities": ["A. an Azure Storage account", "B. Azure Active Directory (Azure AD)", "C. a certificate store", "D. an Azure key vault"], "questionTxt": "To what should an application connect to retrieve security tokens? ", "answer": " B ", "explanation": "Azure AD authenticates users and provides access tokens. An access token is a security token that is issued by an authorization server. It contains information about the user and the app for which the token is intended, which can be used to access Web APIs and other protected resources. Instead of creating apps that each maintain their own username and password information, which incurs a high administrative burden when you need to add or remove users across multiple apps, apps can delegate that responsibility to a centralized identity provider. Azure Active Directory (Azure AD) is a centralized identity provider in the cloud. Delegating authentication and authorization to it enables scenarios such as Conditional Access policies that require a user to be in a specific location, the use of multi-factor authentication, as well as enabling a user to sign in once and then be automatically signed in to all of the web apps that share the same centralized directory. This capability is referred to as Single Sign On (SSO). scenarios ", "questionNumber": 86, "section": "Describe identity, governance, privacy, and compliance features ", "questionNote": ""}, {"questionPossibilities": ["A. Implement Azure Multi-Factor Authentication (MFA)", "B. Sync all the Active Directory user accounts to Azure Active Directory (Azure AD)", "C. Instruct all users to change their password", "D. Create a guest user account in Azure Active Directory (Azure AD) for each user"], "questionTxt": "Your network contains an Active Directory forest. The forest contains 5,000 user accounts. Your company plans to migrate all network resources to Azure and to decommission the on-premises data center. You need to recommend a solution to minimize the impact on users after the planned migration. What should you recommend? ", "answer": " B ", "explanation": "To migrate to Azure and decommission the on-premises data center, you would need to create the 5,000 user accounts in Azure Active Directory.  The easy way to do this is to sync all the Active Directory user accounts to Azure Active Directory (Azure AD).  You can even sync their passwords to further minimize the impact on users. The tool you would use to sync the accounts is Azure AD Connect. The Azure Active Directory Connect synchronization services (Azure AD Connect sync) is a main component of Azure AD Connect. It takes care of all the operations that are related to synchronize identity data between your on-premises environment and Azure AD. whatis ", "questionNumber": 87, "section": "Describe identity, governance, privacy, and compliance features ", "questionNote": ""}, {"questionPossibilities": ["A. a lock", "B. an Azure role", "C. a tag", "D. an Azure policy"], "questionTxt": "You have a resource group named RG1. You need to prevent the creation of virtual machines only in RG1. The solution must ensure that other objects can be created in RG1. What should you use? ", "answer": " D ", "explanation": "Azure policies can be used to define requirements for resource properties during deployment and for already existing resources. Azure Policy controls properties such as the types or locations of resources. Azure Policy is a service in Azure that you use to create, assign, and manage policies. These policies enforce different rules and effects over your resources, so those resources stay compliant with your corporate standards and service level agreements. In this question, we would create an Azure policy assigned to the resource group that denies the creation of virtual machines in the resource group. You could place a read-only lock on the resource group. However, that would prevent the creation of any resources in the resource group, not virtual machines only. Therefore, an Azure Policy is a better solution. ", "questionNumber": 88, "section": "Describe identity, governance, privacy, and compliance features ", "questionNote": ""}, {"questionPossibilities": ["A. network traffic", "B. documents and email messages", "C. an Azure Storage account", "D. an Azure SQL database"], "questionTxt": "What can Azure Information Protection encrypt? ", "answer": " B ", "explanation": "Azure Information Protection can encrypt documents and emails. Azure Information Protection is a cloud-based solution that helps an organization to classify and optionally, protect its documents and emails by applying labels. Labels can be applied automatically by administrators who define rules and conditions, manually by users, or a combination where users are given recommendations. The protection technology uses Azure Rights Management (often abbreviated to Azure RMS). This technology is integrated with other Microsoft cloud services and applications, such as Office 365 and Azure Active Directory. This protection technology uses encryption, identity, and authorization policies. Similarly to the labels that are applied, protection that is applied by using Rights Management stays with the documents and emails, independently of the location – inside or outside your organization, networks, file servers, and applications. protection protectedemail ", "questionNumber": 89, "section": "Describe identity, governance, privacy, and compliance features ", "questionNote": ""}, {"questionPossibilities": ["A. the Knowledge Center website", "B. the Advisor blade from the Azure portal", "C. Compliance Manager from the Service Trust Portal", "D. the Solutions blade from the Azure portal"], "questionTxt": "What should you use to evaluate whether your company’s Azure environment meets regulatory requirements? ", "answer": " C ", "explanation": "Compliance Manager in the Service Trust Portal is a workflow-based risk assessment tool that helps you track, assign, and verify your organization's regulatory compliance activities related to Microsoft Cloud services, such as Microsoft 365, Dynamics 365, and Azure. ", "questionNumber": 90, "section": "Describe identity, governance, privacy, and compliance features ", "questionNote": ""}, {"questionPossibilities": ["A. a read-only lock", "B. an Azure policy", "C. a management group", "D. a reservation"], "questionTxt": "Your company has an Azure subscription that contains resources in several regions. A company policy states that administrators must only be allowed to create additional Azure resources in a region in the country where their office is located. You need to create the Azure resource that must be used to meet the policy requirement. What should you create? ", "answer": " B ", "explanation": "Azure policies can be used to define requirements for resource properties during deployment and for already existing resources. Azure Policy controls properties such as the types or locations of resources. Azure Policy is a service in Azure that you use to create, assign, and manage policies. These policies enforce different rules and effects over your resources, so those resources stay compliant with your corporate standards and service level agreements. Azure Policy meets this need by evaluating your resources for noncompliance with assigned policies. All data stored by Azure Policy is encrypted at rest. Azure Policy offers several built-in policies that are available by default. In this question, we would use the ‘Allowed Locations’ policy to define the locations where resources can be deployed. us/azure/governance/policy/overview ", "questionNumber": 91, "section": "Describe identity, governance, privacy, and compliance features ", "questionNote": ""}, {"questionPossibilities": ["A. No change is needed.", "B. the Microsoft Cloud Partner Portal", "C. Compliance Manager", "D. the Trust Center"], "questionTxt": "This question requires that you evaluate the underlined text to determine if it is correct. From Azure Cloud Shell, you can track your company’s regulatory standards and regulations, such as ISO 27001. Instructions: Review the underlined text. If it makes the statement correct, select “No change is needed.” If the statement is incorrect, select the answer choice that makes the statement correct. ", "answer": " C ", "explanation": "Microsoft Compliance Manager (Preview) is a free workflow-based risk assessment tool that lets you track, assign, and verify regulatory compliance activities related to Microsoft cloud services. Azure Cloud Shell, on the other hand, is an interactive, authenticated, browser-accessible shell for managing Azure resources. overview ", "questionNumber": 92, "section": "Describe identity, governance, privacy, and compliance features ", "questionNote": ""}, {"questionPossibilities": ["A. the Knowledge Center", "B. Azure Marketplace", "C. the Azure portal", "D. the Trust Center"], "questionTxt": "Your company plans to migrate all on-premises data to Azure. You need to identify whether Azure complies with the company’s regional requirements. What should you use? ", "answer": " D ", "explanation": "Azure has more than 90 compliance certifications, including over 50 specific to global regions and countries, such as the US, the European Union, Germany, Japan, the United Kingdom, India and China. You can view a list of compliance certifications in the Trust Center to determine whether Azure meets your regional requirements. portal ", "questionNumber": 93, "section": "Describe identity, governance, privacy, and compliance features ", "questionNote": ""}, {"questionPossibilities": ["A. no change is needed", "B. only enterprises that are registered in Germany", "C. only enterprises that purchase their azure licenses from a partner based in Germany", "D. any user or enterprise that requires its data to reside in Germany"], "questionTxt": "This question requires that you evaluate the underlined text to determine if it is correct. Azure Germany can be used by legal residents of Germany only. Instructions: Review the underlined text. If it makes the statement correct, select “No change is needed”. If the statement is incorrect, select the answer choice that makes the statement correct. ", "answer": " D ", "explanation": "Azure Germany is available to eligible customers and partners globally who intend to do business in the EU/EFTA, including the United Kingdom. Azure Germany offers a separate instance of Microsoft Azure services from within German datacenters. The datacenters are in two locations, Frankfurt/Main and Magdeburg. This placement ensures that customer data remains in Germany and that the datacenters connect to each other through a private network. All customer data is exclusively stored in those datacenters. A designated German company--the German data trustee--controls access to customer data and the systems and infrastructure that hold customer data. welcome?toc=%2fazure%2fgermany%2ftoc.json data-trustee ", "questionNumber": 94, "section": "Describe identity, governance, privacy, and compliance features ", "questionNote": ""}, {"questionPossibilities": ["A. Azure Service Health", "B. Azure Knowledge Center", "C. Azure Security Center", "D. Azure Advisor"], "questionTxt": "What should you use to evaluate whether your company’s Azure environment meets regulatory requirements? ", "answer": " C ", "explanation": "The advanced monitoring capabilities in Security Center lets you track and manage compliance and governance over time. The overall compliance provides you with a measure of how much your subscriptions are compliant with policies associated with your workload. ", "questionNumber": 95, "section": "Describe identity, governance, privacy, and compliance features ", "questionNote": ""}, {"questionPossibilities": ["A. a read-only lock", "B. an Azure policy", "C. a management group", "D. a reservation"], "questionTxt": "Your company has an Azure subscription that contains resources in several regions. You need to ensure that administrators can only create resources in those regions. What should you use? ", "answer": " B ", "explanation": "", "questionNumber": 96, "section": "Describe identity, governance, privacy, and compliance features ", "questionNote": ""}, {"questionPossibilities": ["A. a Canadian government contractor", "B. a European government contractor", "C. a United States government entity", "D. a United States government contractor", "E. a European government entity"], "questionTxt": "Which two types of customers are eligible to use Azure Government to develop a cloud solution? Each correct answer presents a complete solution. NOTE: Each correct selection is worth one point. ", "answer": " CD ", "explanation": "Azure Government is a cloud environment specifically built to meet compliance and security requirements for US government. This mission-critical cloud delivers breakthrough innovation to U.S. government customers and their partners. Azure Government applies to government at any level – from state and local governments to federal agencies including Department of Defense agencies. The key difference between Microsoft Azure and Microsoft Azure Government is that Azure Government is a sovereign cloud. It's a physically separated instance of Azure, dedicated to U.S. government workloads only. It's built exclusively for government agencies and their solution providers. government ", "questionNumber": 97, "section": "Describe identity, governance, privacy, and compliance features ", "questionNote": ""}, {"questionPossibilities": ["A. Microsoft provides mainstream support for a service for five years.", "B. Microsoft provides a minimum of 12 months’ notice before ending support for a service.", "C. After a service is made generally available, Microsoft provides support for the service for a minimum of four years.", "D. When a service is retired, you can purchase extended support for the service for up to five years."], "questionTxt": "Which statement accurately describes the Modern Lifecycle Policy for Azure services? ", "answer": " B ", "explanation": "For products governed by the Modern Lifecycle Policy, Microsoft will provide a minimum of 12 months' notification prior to ending support if no successor product or service is offered – excluding free services or preview releases. ", "questionNumber": 98, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": ""}, {"questionPossibilities": ["A. No change is needed.", "B. Access control (IAM)", "C. Budget alerts", "D. Compliance"], "questionTxt": "This question requires that you evaluate the underlined text to determine if it is correct. You can use Advisor recommendations in Azure to send email alerts when the cost of the current billing period for an Azure subscription exceeds a specified limit. Instructions: Review the underlined text. If it makes the statement correct, select “No change is needed.” If the statement is incorrect, select the answer choice that makes the statement correct. ", "answer": " C ", "explanation": "Budget alerts notify you when spending, based on usage or cost, reaches or exceeds the amount defined in the alert condition of the budget. Cost Management budgets are created using the Azure portal or the Azure Consumption API. ", "questionNumber": 99, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your company has an Azure subscription that contains the following unused resources: Five groups in Azure AD You need to reduce the Azure costs for the company. Solution: You remove the unused network interfaces. Does this meet the goal? ", "answer": " B ", "explanation": "You are not charged for unused network interfaces. Therefore, deleting unused network interfaces will not reduce the Azure costs for the company. ", "questionNumber": 10, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your company has an Azure subscription that contains the following unused resources: Five groups in Azure AD You need to reduce the Azure costs for the company. Solution: You remove the unused public IP addresses. Does this meet the goal? ", "answer": " A ", "explanation": "You are charged for public IP addresses.  Therefore, deleting unused public IP addresses will reduce the Azure costs. ", "questionNumber": 10, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. No change is needed", "B. Developer", "C. Basic", "D. Premier"], "questionTxt": "This question requires that you evaluate the underlined text to determine if it is correct. A support plan solution that gives you best practice information, health status and notifications, and 24/7 access to billing information at the lowest possible cost is a Standard support plan. Instructions: Review the underlined text. If it makes the statement correct, select “No change is needed”. If the statement is incorrect, select the answer choice that makes the statement correct. ", "answer": " C ", "explanation": "A basic support plan provides: 24x7 access to billing and subscription support, online self-help, documentation, whitepapers, and support forums Best practices: Access to full set of Azure Advisor recommendations Health Status and Notifications: Access to personalized Service Health Dashboard & Health API ", "questionNumber": 102, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": ""}, {"questionPossibilities": ["A. Premier and Professional Direct only", "B. Premier, Professional Direct, and Standard only", "C. Premier, Professional Direct, Standard, and Developer only", "D. Premier, Professional Direct, Standard, Developer, and Basic"], "questionTxt": "In which Azure support plans can you open a new support request? ", "answer": " C ", "explanation": "You can open support cases in the following plans: Premier, Professional Direct, Standard, and Developer only. You cannot open support cases in the Basic support plan. ", "questionNumber": 103, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": ""}, {"questionPossibilities": ["A. No change is needed.", "B. the Azure portal", "C. the Knowledge Center", "D. the Security & Compliance admin center"], "questionTxt": "This question requires that you evaluate the underlined text to determine if it is correct. You can create an Azure support request from support.microsoft.com. Instructions: Review the underlined text. If it makes the statement correct, select “No change is needed.” If the statement is incorrect, select the answer choice that makes the statement correct. ", "answer": " B ", "explanation": "You can create an Azure support request from the Help and Support blade in the Azure portal or from the context menu of an Azure resource in the Support + Troubleshooting section. ", "questionNumber": 104, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your company has an Azure subscription that contains the following unused resources: Five groups in Azure AD You need to reduce the Azure costs for the company. Solution: You remove the unused groups. Does this meet the goal? ", "answer": " B ", "explanation": "You are not charged for Azure Active Directory Groups.  Therefore, deleting unused groups will not reduce your Azure costs. ", "questionNumber": 10, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. No change is needed", "B. Developer", "C. Basic", "D. Professional Direct"], "questionTxt": "This question requires that you evaluate the underlined text to determine if it is correct. The Azure Standard support plan is the lowest cost option to receive 24x7 access to support engineers by phone. Instructions: Review the underlined text. If it makes the statement correct, select “No change is needed”. If the statement is incorrect, select the answer choice that makes the statement correct. ", "answer": " A ", "explanation": "The Basic support plan is free so is therefore the cheapest.  The Developer support plan is the cheapest paid-for support plan.  The order of support plans in terms of cost ranging from the cheapest to most expensive is: Basic, Developer, Standard, Professional Direct, Premier. However, 24/7 access to technical support by email and phone is only available for Standard, Professional Direct, Premier plans. ", "questionNumber": 106, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": ""}, {"questionPossibilities": ["A. uptime", "B. feature availability", "C. bandwidth", "D. performance"], "questionTxt": "What is guaranteed in an Azure Service Level Agreement (SLA) for virtual machines? ", "answer": " A ", "explanation": "The SLA for virtual machines guarantees ‘uptime’. The amount of uptime guaranteed depends on factors such as whether the VMs are in an availability set or availability zone if there is more than one VM, the distribution of the VMs if there is more than one or the disk type if it is a single VM. The SLA for Virtual Machines states: For all Virtual Machines that have two or more instances deployed across two or more Availability Zones in the same Azure region, we guarantee you will have Virtual Machine Connectivity to at least one instance at least 99.99% of the time. For all Virtual Machines that have two or more instances deployed in the same Availability Set or in the same Dedicated Host Group, we guarantee you will have Virtual Machine Connectivity to at least one instance at least 99.95% of the time. For any Single Instance Virtual Machine using Premium SSD or Ultra Disk for all Operating System Disks and Data Disks, we guarantee you will have Virtual Machine Connectivity of at least 99.9%. machines/v1_9/ ", "questionNumber": 107, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your company plans to purchase an Azure subscription. The company’s support policy states that the Azure environment must provide an option to access support engineers by phone or email. You need to recommend which support plan meets the support policy requirement. Solution: Recommend a Basic support plan. Does this meet the goal? ", "answer": " B ", "explanation": "The Basic support plan does not have any technical support for engineers. Access to Support Engineers via email or phone is available in the following support plans: Premier, Professional Direct and standard. ", "questionNumber": 108, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your company plans to purchase an Azure subscription. The company’s support policy states that the Azure environment must provide an option to access support engineers by phone or email. You need to recommend which support plan meets the support policy requirement. Solution: Recommend a Standard support plan. Does this meet the goal? ", "answer": " A ", "explanation": "The Standard, Professional Direct, and Premier support plans have technical support for engineers via email and phone. ", "questionNumber": 109, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your company plans to purchase an Azure subscription. The company’s support policy states that the Azure environment must provide an option to access support engineers by phone or email. You need to recommend which support plan meets the support policy requirement. Solution: Recommend a Premier support plan. Does this meet the goal? ", "answer": " A ", "explanation": "The Standard, Professional Direct, and Premier support plans have technical support for engineers via email and phone. ", "questionNumber": 110, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Premier", "B. Developer", "C. Professional Direct", "D. Standard"], "questionTxt": "Your company plans to request an architectural review of an Azure environment from Microsoft. The company currently has a Basic support plan. You need to recommend a new support plan for the company. The solution must minimize costs. Which support plan should you recommend? ", "answer": " A ", "explanation": "The Premier support plan provides customer specific architectural support such as design reviews, performance tuning, configuration and implementation assistance delivered by Microsoft Azure technical specialists. ", "questionNumber": 111, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": ""}, {"questionPossibilities": [], "questionTxt": "HOTSPOT For each of the following statements, select Yes if the statement is true. Otherwise, select No. NOTE: Each correct selection is worth one point. Hot Area: ", "answer": "  ", "explanation": "Box 1: Yes Most services go to private preview then public preview before being released to general availability. The private preview is only available to certain Azure customers for evaluation purposes. The public preview is available to all Azure customers. Box 2: No Azure services in public preview can be managed using the regular management tools: Azure Portal, Azure CLI and PowerShell. Box 3: No Services in private or public preview are usually offered at reduced costs.  However, the costs increase, not decrease when the services are released to general availability. ", "questionNumber": 112, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": ""}, {"questionPossibilities": ["A. a Dev/Test subscription", "B. Software Assurance", "C. an Enterprise Agreement (EA)", "D. a pay-as-you-go subscription"], "questionTxt": "What is required to use Azure Cost Management? ", "answer": " C ", "explanation": "Azure customers with an Azure Enterprise Agreement (EA), Microsoft Customer Agreement (MCA), or Microsoft Partner Agreement (MPA) can use Azure Cost Management. Cost management is the process of effectively planning and controlling costs involved in your business. Cost management tasks are normally performed by finance, management, and app teams. Azure Cost Management + Billing helps organizations plan with cost in mind. It also helps to analyze costs effectively and take action to optimize cloud spending. mgt ", "questionNumber": 113, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": ""}, {"questionPossibilities": [], "questionTxt": "HOTSPOT To complete the sentence, select the appropriate option in the answer area. Hot Area: ", "answer": "  ", "explanation": "A stopped (deallocated) VM is offline and not mounted on an Azure host server.  Starting a VM mounts the VM on a host server before the VM starts.  As soon as the VM is mounted, it becomes chargeable.  For this reason, you are unable to start a VM after a trial has expired. Incorrect Answers: You are not charged for Azure Active Directory user accounts so you can continue to create accounts. You can access data that is already stored in Azure. You can access the Azure Portal.  You can also reactivate and upgrade the expired subscription in the portal. ", "questionNumber": 114, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": ""}, {"questionPossibilities": ["A. Yes", "B. No"], "questionTxt": "Your company plans to purchase an Azure subscription. The company’s support policy states that the Azure environment must provide an option to access support engineers by phone or email. You need to recommend which support plan meets the support policy requirement. Solution: Recommend a Professional Direct support plan. Does this meet the goal? ", "answer": " A ", "explanation": "The Basic support plan does not have any technical support for engineers. The Developer support plan has only technical support for engineers via email. The Standard, Professional Direct, and Premier support plans have technical support for engineers via email and phone. ", "questionNumber": 115, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution. After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen."}, {"questionPossibilities": ["A. Deallocate the virtual machines during off hours.", "B. Use Azure Hybrid Benefit.", "C. Configure Azure Cost Management budgets.", "D. Use Azure reservations."], "questionTxt": "Your company has a Software Assurance agreement that includes Microsoft SQL Server licenses. You plan to deploy SQL Server on Azure virtual machines. What should you do to minimize licensing costs for the deployment? ", "answer": " B ", "explanation": "Azure Hybrid Benefit is a licensing benefit that helps you to significantly reduce the costs of running your workloads in the cloud. It works by letting you use your onpremises Software Assurance-enabled Windows Server and SQL Server licenses on Azure. ", "questionNumber": 116, "section": "Describe Azure cost management and Service Level Agreements ", "questionNote": ""}]